project/src/DataProcessors/ОчередьЗагрузкиОбъектовФормата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>ОчередьЗагрузкиОбъектовФормата</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВерсияФормата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииФормата</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъектовФормата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

project/src/Catalogs/СвойстваФормата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>СвойстваФормата</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ОбъектыФормата</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОписаниеТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектХранительСвойств</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОписание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязательное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбщегоСвойства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбщихРеквизитов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоставнойТип</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НижняяГраница</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипФормата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяТипа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Фасеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидФасета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФасета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

project/src/DataProcessors/ОчередьЗагрузкиОбъектовФормата/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступность();
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовФормы
&НаКлиенте
Процедура ВерсияФорматаПриИзменении(Элемент)
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура РазрывПерекрестныхСсылокПриИзменении(Элемент)
	УстановитьДоступность();
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Сформировать(Команда)
	Если НЕ ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	СформироватьНаСервере(Ложь);
КонецПроцедуры
&НаКлиенте
Процедура СохранитьОчередь(Команда)
	НастройкиДиалога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	НастройкиДиалога.Фильтр = НСтр("ru = 'Текстовый файл (*.txt)'") + "|*.txt";
	НастройкиДиалога.Заголовок = НСтр("ru='Укажите файл для сохранения очереди загрузки'");
	ВыбранФайл = Новый ОписаниеОповещения("ВыбранФайлДляЗаписи", ЭтаФорма, Новый Структура("ИмяРеквизитаФормы", "ОчередьЗагрузки"));
	НастройкиДиалога.Показать(ВыбранФайл);
КонецПроцедуры

&НаКлиенте
Процедура ВосстановитьНастройкиПерекрестныхСсылок(Команда)
	НастройкиДиалога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	НастройкиДиалога.Фильтр = НСтр("ru = 'Текстовый файл (*.txt)'") + "|*.txt";
	НастройкиДиалога.Заголовок = НСтр("ru='Укажите файл для загрузки ручного порядка загрузки перекрестных ссылок'");
	ВыбранФайл = Новый ОписаниеОповещения("ВыбранФайлДляЧтения", ЭтаФорма);
	НастройкиДиалога.Показать(ВыбранФайл);
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиПерекрестныхСсылок(Команда)
	Если РазрывПерекрестныхСсылок.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Ручной порядок перекрестных ссылок не задан'"));
		Возврат;
	КонецЕсли;
	НастройкиДиалога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	НастройкиДиалога.Фильтр = НСтр("ru = 'Текстовый файл (*.txt)'") + "|*.txt";
	НастройкиДиалога.Заголовок = НСтр("ru='Укажите файл для сохранения ручного порядка загрузки перекрестных ссылок'");
	ВыбранФайл = Новый ОписаниеОповещения("ВыбранФайлДляЗаписи", ЭтаФорма, Новый Структура("ИмяРеквизитаФормы", "РазрывПерекрестныхСсылок"));
	НастройкиДиалога.Показать(ВыбранФайл);
КонецПроцедуры

&НаКлиенте
Процедура ПредварительныйАнализ(Команда)
	Если НЕ ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	СформироватьНаСервере(Истина);
	УстановитьДоступность();
КонецПроцедуры
#КонецОбласти
#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура УстановитьДоступность()
	Если НЕ ЗначениеЗаполнено(Объект.ВерсияФормата) Тогда
		Элементы.Результаты.Доступность = Ложь;
		Возврат;
	КонецЕсли;
	Элементы.Результаты.Доступность = Истина;
	Элементы.ОчередьЗагрузки.Доступность = Ложь;
	Если ПроведенАнализПерекрестныхСсылок Тогда
		Если ПерекрестныеСсылки.КоличествоСтрок() = 0
			Или ПерекрестныеСсылки.КоличествоСтрок() = РазрывПерекрестныхСсылок.Количество() Тогда
			Элементы.ОчередьЗагрузки.Доступность = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура СформироватьНаСервере(ПредварительныйАнализ)
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбъектыФормата.Ссылка КАК ОбъектСсылка,
	|	ОбъектыФормата.Наименование КАК ОбъектНаименование,
	|	СвойстваФормата.ОбъектХранительСвойств КАК КлючевыеСвойства
	|ПОМЕСТИТЬ ТабОбъекты
	|ИЗ Справочник.ОбъектыФормата КАК ОбъектыФормата
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	Справочник.СвойстваФормата КАК СвойстваФормата
	|ПО 
	|	ОбъектыФормата.Ссылка = СвойстваФормата.Владелец
	|	И СвойстваФормата.ТипОбщегоСвойства = ЗНАЧЕНИЕ(Перечисление.ТипыОбщихРеквизитов.КлючевыеСвойства)
	|ГДЕ ОбъектыФормата.Владелец = &ВерсияФормата
	|	И ОбъектыФормата.Наименование ПОДОБНО &ФильтрПоТипуОбъекта
	|;
	|ВЫБРАТЬ
	|	СвойстваШ.Владелец.Наименование КАК ОбъектФормата,
	|	ТабОбъекты.ОбъектНаименование КАК СсылаетсяНа,
	|	ЛОЖЬ КАК Обработано,
	|	ЛОЖЬ КАК Перекрестная,
	|	0 КАК Очередь
	|ИЗ Справочник.СвойстваФормата.Состав КАК СвойстваСостав
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	ТабОбъекты
	|ПО ТабОбъекты.КлючевыеСвойства = СвойстваСостав.ИмяТипа
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
	|	Справочник.СвойстваФормата КАК СвойстваШ
	|ПО 
	|	СвойстваСостав.Ссылка = СвойстваШ.Ссылка
	|ГДЕ СвойстваШ.Владелец В (ВЫБРАТЬ РАЗЛИЧНЫЕ ОбъектСсылка ИЗ ТабОбъекты)
	|	И ИмяТипа В (ВЫБРАТЬ РАЗЛИЧНЫЕ КлючевыеСвойства ИЗ ТабОбъекты)
	|	И СвойстваШ.Владелец.Наименование <> ТабОбъекты.ОбъектНаименование
	|;
	|ВЫБРАТЬ
	|	ТабОбъекты.ОбъектНаименование КАК ОбъектФормата,
	|	ВЫБОР КОГДА СвойстваСостав.ИмяТипа В (ВЫБРАТЬ РАЗЛИЧНЫЕ КлючевыеСвойства ИЗ ТабОбъекты) ТОГДА
	|		1
	|	ИНАЧЕ
	|		0
	|	КОНЕЦ КАК СсылочныйРеквизит,
	|	ВЫБОР КОГДА СвойстваСостав.ИмяТипа = ТабОбъекты.КлючевыеСвойства Тогда
	|		1
	|	ИНАЧЕ
	|		0
	|	КОНЕЦ КАК СсылкаНаСебя
	|ИЗ ТабОбъекты
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.СвойстваФормата КАК СвойстваШ
	|ПО ТабОбъекты.ОбъектСсылка = СвойстваШ.Владелец
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Справочник.СвойстваФормата.Состав КАК СвойстваСостав
	|ПО СвойстваСостав.Ссылка = СвойстваШ.Ссылка
	|";
	ТабПерекрестныеСсылки = Новый ТаблицаЗначений;
	ТабПерекрестныеСсылки.Колонки.Добавить("ОбъектФормата1");
	ТабПерекрестныеСсылки.Колонки.Добавить("ОбъектФормата2");
	
	ОчередьЗагрузки.Очистить();
	ТабОчередьЗагрузки.Очистить();
	
	// Справочники
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ВерсияФормата", Объект.ВерсияФормата);
	Запрос.УстановитьПараметр("ФильтрПоТипуОбъекта","Справочник.%");
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ТабРасчетОчереди = РезультатЗапроса[2].Выгрузить();
	ТабРасчетОчереди.Свернуть("ОбъектФормата", "СсылочныйРеквизит, СсылкаНаСебя");
	НомерОчереди = 1;
	ЗаполнитьНулевуюОчередьЗагрузки(ТабРасчетОчереди, НомерОчереди, Ложь);
	Если ТабОчередьЗагрузки.Количество() > 0 Тогда
		НомерОчереди = НомерОчереди + 1;
	КонецЕсли;
	ТабСсылки = РезультатЗапроса[1].Выгрузить();
	ПроверитьПерекрестныеСсылки(ТабСсылки, ТабПерекрестныеСсылки);
	Если НЕ ПредварительныйАнализ Тогда
		ПостроитьОчередьЗагрузки(ТабСсылки, НомерОчереди, ТабПерекрестныеСсылки, Ложь);
	КонецЕсли;
	
	// Документы
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ВерсияФормата", Объект.ВерсияФормата);
	Запрос.УстановитьПараметр("ФильтрПоТипуОбъекта","Документ.%");
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ТабРасчетОчереди = РезультатЗапроса[2].Выгрузить();
	ТабРасчетОчереди.Свернуть("ОбъектФормата", "СсылочныйРеквизит, СсылкаНаСебя");
	КоличествоСтрокОчередьЗагрузки = ТабОчередьЗагрузки.Количество();
	ЗаполнитьНулевуюОчередьЗагрузки(ТабРасчетОчереди, НомерОчереди, Истина);
	Если ТабОчередьЗагрузки.Количество() > КоличествоСтрокОчередьЗагрузки Тогда
		НомерОчереди = НомерОчереди + 1;
	КонецЕсли;
	ТабСсылки = РезультатЗапроса[1].Выгрузить();
	ПроверитьПерекрестныеСсылки(ТабСсылки, ТабПерекрестныеСсылки);
	Если НЕ ПредварительныйАнализ Тогда
		ПостроитьОчередьЗагрузки(ТабСсылки, НомерОчереди, ТабПерекрестныеСсылки, Истина);
	КонецЕсли;
	
	Если ПредварительныйАнализ Тогда
		ПерекрестныеСсылки.Очистить();
		Для Каждого СтрТаб Из ТабПерекрестныеСсылки Цикл
			ПерекрестныеСсылки.ДобавитьСтроку("" + СтрТаб.ОбъектФормата1+";"+СтрТаб.ОбъектФормата2);
		КонецЦикла;
		ПроведенАнализПерекрестныхСсылок = Истина;
		ТабОчередьЗагрузки.Очистить();
	Иначе
		ЗаполнитьТекстЭкспортногоМетода();
	КонецЕсли;
КонецПроцедуры

Процедура ОбработатьОчередьОбъектов(ТабСсылки, НомерОчереди, ТабПерекрестныеСсылки, ИскатьКлючевоеСвойствоДата)
	Для Каждого СтрТаб Из ТабСсылки Цикл
		Если СтрТаб.Обработано Тогда
			Продолжить;
		КонецЕсли;
		Если СтрТаб.Перекрестная Тогда
			Если РазрывПерекрестныхСсылок.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			СтрОбъектВедущий =  РазрывПерекрестныхСсылок.НайтиСтроки(Новый Структура("ВедущийОбъект, ВедомыйОбъект", СтрТаб.ОбъектФормата, СтрТаб.СсылаетсяНа));
			// Объект - ведущий, загружается вперед, эту связь можно пометить как обработанную
			Если СтрОбъектВедущий.Количество() > 0 Тогда
				СтрТаб.Очередь = НомерОчереди;
				СтрТаб.Обработано = Истина;
			КонецЕсли;
			// Объект - ведомый, загружается после ведущего. Считаем обработанным если ведущий объект распределен в очередь.
			СтрОбъектВедомый =  РазрывПерекрестныхСсылок.НайтиСтроки(Новый Структура("ВедущийОбъект, ВедомыйОбъект", СтрТаб.СсылаетсяНа, СтрТаб.ОбъектФормата));
			Если СтрОбъектВедомый.Количество() > 0 Тогда
				СтрокиОчередьЗагрузки = ТабОчередьЗагрузки.НайтиСтроки(Новый Структура("ОбъектФормата", СтрТаб.СсылаетсяНа));
				Если СтрокиОчередьЗагрузки.Количество() > 0 Тогда
					СтрТаб.Очередь = НомерОчереди;
					СтрТаб.Обработано = Истина;
				КонецЕсли;
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		СтрокиОчередьЗагрузки = ТабОчередьЗагрузки.НайтиСтроки(Новый Структура("ОбъектФормата", СтрТаб.ОбъектФормата));
		Если СтрокиОчередьЗагрузки.Количество() > 0 Тогда
			// То что добавлено в первую очередь.
			СтрТаб.Обработано = Истина;
			Продолжить;
		КонецЕсли;
		СтрокиОчередьЗагрузки = ТабОчередьЗагрузки.НайтиСтроки(Новый Структура("ОбъектФормата", СтрТаб.СсылаетсяНа));
		Если СтрокиОчередьЗагрузки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрТаб.Очередь = НомерОчереди;
		СтрТаб.Обработано = Истина;
	КонецЦикла;
	// Поиск объектов формата по которым очередь заполнена у всех свойств.
	ТекОбъектФормата = "";
	ОбъектГотов = Истина;
	ЭтоПерекрестныйОбъект = Ложь;
	ГотовыеПерекрестные = Новый Массив;
	Для Каждого СтрТаб Из ТабСсылки Цикл
		Если ТекОбъектФормата <> "" И СтрТаб.ОбъектФормата <> ТекОбъектФормата Тогда
			Если ОбъектГотов Тогда
				Если ЭтоПерекрестныйОбъект Тогда
					ГотовыеПерекрестные.Добавить(ТекОбъектФормата);
				Иначе
					СтрокиОчередьЗагрузки = ТабОчередьЗагрузки.НайтиСтроки(Новый Структура("ОбъектФормата", ТекОбъектФормата));
					Если СтрокиОчередьЗагрузки.Количество() = 0 Тогда
						СтрНов = ТабОчередьЗагрузки.Добавить();
						СтрНов.ОбъектФормата = ТекОбъектФормата;
						СтрНов.Порядок = НомерОчереди;
						Если ИскатьКлючевоеСвойствоДата Тогда
							СтрНов.ПорядокПоСвойствам = НайтиКлючевоеСвойствоДата(ТекОбъектФормата);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли; 
			ТекОбъектФормата = СтрТаб.ОбъектФормата;
			ОбъектГотов = Истина;
			ЭтоПерекрестныйОбъект = Ложь;
		КонецЕсли;
		ТекОбъектФормата = СтрТаб.ОбъектФормата;
		Если СтрТаб.Перекрестная И НЕ СтрТаб.Обработано Тогда
			// перекрестный объект не расшитый вручную.
			ЭтоПерекрестныйОбъект = Истина;
		ИначеЕсли ОбъектГотов И НЕ СтрТаб.Обработано Тогда
			ОбъектГотов = Ложь;
		КонецЕсли;
	КонецЦикла;
	// Проверка перекрестных объектов, их можно добавлять вместе в одну очередь
	Если ГотовыеПерекрестные.Количество() > 1 Тогда
		Для Каждого СтрТаб Из ТабПерекрестныеСсылки Цикл
			Если ГотовыеПерекрестные.Найти(СтрТаб.ОбъектФормата1) <> Неопределено 
				И ГотовыеПерекрестные.Найти(СтрТаб.ОбъектФормата2) <> Неопределено Тогда
				СтрокиОчередьЗагрузки = ТабОчередьЗагрузки.НайтиСтроки(Новый Структура("ОбъектФормата", СтрТаб.ОбъектФормата1));
				Если СтрокиОчередьЗагрузки.Количество() = 0 Тогда
					СтрНов = ТабОчередьЗагрузки.Добавить();
					СтрНов.ОбъектФормата = СтрТаб.ОбъектФормата1;
					СтрНов.Порядок = НомерОчереди;
					Если ИскатьКлючевоеСвойствоДата Тогда
						СтрНов.ПорядокПоСвойствам = НайтиКлючевоеСвойствоДата(СтрТаб.ОбъектФормата1);
					КонецЕсли;
				КонецЕсли;
				СтрокиОчередьЗагрузки = ТабОчередьЗагрузки.НайтиСтроки(Новый Структура("ОбъектФормата", СтрТаб.ОбъектФормата2));
				Если СтрокиОчередьЗагрузки.Количество() = 0 Тогда
					СтрНов = ТабОчередьЗагрузки.Добавить();
					СтрНов.ОбъектФормата = СтрТаб.ОбъектФормата2;
					СтрНов.Порядок = НомерОчереди;
					Если ИскатьКлючевоеСвойствоДата Тогда
						СтрНов.ПорядокПоСвойствам = НайтиКлючевоеСвойствоДата(СтрТаб.ОбъектФормата2);
					КонецЕсли;
				КонецЕсли;
				МасСтрокиПерекрестные = ТабСсылки.НайтиСтроки(Новый Структура("ОбъектФормата, Обработано", СтрТаб.ОбъектФормата1, Ложь));
				Для Каждого СтрП Из МасСтрокиПерекрестные Цикл
					СтрП.Обработано = Истина;
				КонецЦикла;
				МасСтрокиПерекрестные = ТабСсылки.НайтиСтроки(Новый Структура("ОбъектФормата, Обработано", СтрТаб.ОбъектФормата2, Ложь));
				Для Каждого СтрП Из МасСтрокиПерекрестные Цикл
					СтрП.Обработано = Истина;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыбранФайлДляЗаписи(ИменаФайлов, ДополнительныеПараметры) Экспорт
	Если ИменаФайлов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ИмяФайлаДляЗаписи = ИменаФайлов[0];
	Если ДополнительныеПараметры.ИмяРеквизитаФормы = "ОчередьЗагрузки" Тогда
		ОчередьЗагрузки.Записать(ИмяФайлаДляЗаписи);
	ИначеЕсли ДополнительныеПараметры.ИмяРеквизитаФормы = "РазрывПерекрестныхСсылок" Тогда
		ТХДок = Новый ТекстовыйДокумент;
		Для Каждого СтрТаб Из РазрывПерекрестныхСсылок Цикл
			ТХДок.ДобавитьСтроку("" + СтрТаб.ВедущийОбъект + ";" + СтрТаб.ВедомыйОбъект);
		КонецЦикла;
		ТХДок.Записать(ИмяФайлаДляЗаписи);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыбранФайлДляЧтения(ИменаФайлов, ДополнительныеПараметры) Экспорт
	Если ИменаФайлов = Неопределено Тогда
		Возврат;
	КонецЕсли;
	РазрывПерекрестныхСсылок.Очистить();
	ИмяФайлаДляЧтения = ИменаФайлов[0];
	ТХДок = Новый ТекстовыйДокумент;
	ТХДок.Прочитать(ИмяФайлаДляЧтения);
	Для Стр = 1 По ТХДок.КоличествоСтрок() Цикл
		СтрТекст = ТХДок.ПолучитьСтроку(Стр);
		Если СтрНайти(СтрТекст, ";") = 0 Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не удалось прочитать. Неверный формат файла.'"));
			Возврат;
		КонецЕсли;
		МасИмена = СтрРазделить(СтрТекст, ";");
		НовСтр = РазрывПерекрестныхСсылок.Добавить();
		НовСтр.ВедущийОбъект = МасИмена[0];
		НовСтр.ВедомыйОбъект = МасИмена[1];
	КонецЦикла;
	УстановитьДоступность();
КонецПроцедуры

Процедура ЗаполнитьНулевуюОчередьЗагрузки(ТабРасчетОчереди, НачальныйУровень, ИскатьКлючевоеСвойствоДата)
	Для Каждого СтрТаб Из ТабРасчетОчереди Цикл
		Если СтрТаб.СсылочныйРеквизит = 0
			Или СтрТаб.СсылочныйРеквизит = СтрТаб.СсылкаНаСебя Тогда
			СтрОчередь = ТабОчередьЗагрузки.Добавить();
			СтрОчередь.ОбъектФормата = СтрТаб.ОбъектФормата;
			СтрОчередь.Порядок = НачальныйУровень;
			Если ИскатьКлючевоеСвойствоДата Тогда
				СтрОчередь.ПорядокПоСвойствам = НайтиКлючевоеСвойствоДата(СтрТаб.ОбъектФормата);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПроверитьПерекрестныеСсылки(ТабСсылки, ТабПерекрестныеСсылки)
	ЕстьВедущийПользователь = РазрывПерекрестныхСсылок.НайтиСтроки(Новый Структура("ВедущийОбъект", "Справочник.Пользователи")).Количество() > 0;
	Для Каждого СтрТаб Из ТабСсылки Цикл
		Если СтрТаб.Перекрестная Тогда
			Продолжить;
		КонецЕсли;
		СтрокиОчереди = ТабОчередьЗагрузки.НайтиСтроки(Новый Структура("ОбъектФормата", СтрТаб.СсылаетсяНа));
		Если СтрокиОчереди.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрокиОчереди = ТабОчередьЗагрузки.НайтиСтроки(Новый Структура("ОбъектФормата", СтрТаб.ОбъектФормата));
		Если СтрокиОчереди.Количество() > 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрокаНаоборот = ТабСсылки.НайтиСтроки(Новый Структура("ОбъектФормата, СсылаетсяНа", СтрТаб.СсылаетсяНа, СтрТаб.ОбъектФормата));
		Если СтрокаНаоборот.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрокаНаоборот[0].Перекрестная = Истина;
		СтрТаб.Перекрестная = Истина;
		Если ТабПерекрестныеСсылки.Найти(СтрТаб.СсылаетсяНа, "ОбъектФормата1") <> Неопределено
			И ТабПерекрестныеСсылки.Найти(СтрТаб.ОбъектФормата, "ОбъектФормата2") <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Если ТабПерекрестныеСсылки.Найти(СтрТаб.СсылаетсяНа, "ОбъектФормата2") <> Неопределено
			И ТабПерекрестныеСсылки.Найти(СтрТаб.ОбъектФормата, "ОбъектФормата1") <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		СтрПерекрестные = ТабПерекрестныеСсылки.Добавить();
		СтрПерекрестные.ОбъектФормата1 = СтрТаб.СсылаетсяНа;
		СтрПерекрестные.ОбъектФормата2 = СтрТаб.ОбъектФормата;
	КонецЦикла;
КонецПроцедуры

Процедура ПостроитьОчередьЗагрузки(ТабСсылки, НомерОчереди, ТабПерекрестныеСсылки, ИскатьКлючевоеСвойствоДата)
	ЗавершеноУспешно = Ложь;
	Пока Истина Цикл
		ОбработатьОчередьОбъектов(ТабСсылки, НомерОчереди, ТабПерекрестныеСсылки, ИскатьКлючевоеСвойствоДата);
		СтрокаНеОбработана = ТабСсылки.Найти(Ложь, "Обработано");
		Если СтрокаНеОбработана = Неопределено Тогда
			ЗавершеноУспешно = Истина;
			Прервать;
		КонецЕсли;
		// Проверка на зацикливание
		СтрокиОчередьЗагрузки = ТабОчередьЗагрузки.НайтиСтроки(Новый Структура("Порядок", НомерОчереди));
		СтрокаДобавлена = СтрокиОчередьЗагрузки.Количество() > 0;
		Если СтрокаДобавлена = Ложь Тогда
			ОбщегоНазначения.СообщитьПользователю("Обработка прервана из за зацикливания, в очередь загрузки размещены не все объекты.");
			Прервать;
		КонецЕсли;
		НомерОчереди = НомерОчереди + 1;
	КонецЦикла;
	Если ЗавершеноУспешно = Ложь Тогда
		СтрокиНеОбработано = ТабСсылки.НайтиСтроки(Новый Структура("Обработано", Ложь));
		СтрШаблон = "//	Не удалось определить порядок загрузки для объекта формата %1%";
		МасОбъекты = Новый Массив;
		Для Каждого СтрТаб Из СтрокиНеОбработано Цикл
			Если МасОбъекты.Найти(СтрТаб.ОбъектФормата) = Неопределено Тогда
				СтрТекст = СтрЗаменить(СтрШаблон, "%1%", СтрТаб.ОбъектФормата);
				ОчередьЗагрузки.ДобавитьСтроку(СтрТекст);
				МасОбъекты.Добавить(СтрТаб.ОбъектФормата);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Функция НайтиКлючевоеСвойствоДата(ОбъектФормата)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	Свойства.Ссылка
	|ИЗ Справочник.СвойстваФормата КАК Свойства
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОбъектыФормата КАК Объекты
	|ПО Свойства.Владелец = Объекты.Ссылка
	|ГДЕ Объекты.Владелец = &ВерсияФормата И Объекты.Наименование = &ОбъектФормата
	|	И Свойства.Родитель.Наименование = ""КлючевыеСвойства"" И Свойства.Наименование = ""Дата""";
	Запрос.УстановитьПараметр("ОбъектФормата", ОбъектФормата);
	Запрос.УстановитьПараметр("ВерсияФормата", Объект.ВерсияФормата);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат "";
	КонецЕсли;
	Возврат "КлючевыеСвойства.Дата";
КонецФункции

Процедура ЗаполнитьТекстЭкспортногоМетода()
	ИмяПространстваИмен = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ВерсияФормата, "ПространствоИмен");
	ОчередьЗагрузки.ДобавитьСтроку("Функция Функция1(ТипОбъектаФормата) Экспорт");
	ОчередьЗагрузки.ДобавитьСтроку(Символы.Таб + "ОчередьЗагрузки = ОчередьЗагрузкиОбъектов();");
	ОчередьЗагрузки.ДобавитьСтроку(Символы.Таб + "Результат = ОчередьЗагрузки.Получить(ТипОбъектаФормата);");
	ОчередьЗагрузки.ДобавитьСтроку(Символы.Таб + "Если Результат <> Неопределено Тогда");
	ОчередьЗагрузки.ДобавитьСтроку(Символы.Таб + Символы.Таб + "Возврат Результат;");
	ОчередьЗагрузки.ДобавитьСтроку(Символы.Таб + "КонецЕсли;");
	ОчередьЗагрузки.ДобавитьСтроку(Символы.Таб + "Возврат Новый Структура(""Приоритет, ПутьКДате"", 0, """");");
	ОчередьЗагрузки.ДобавитьСтроку("КонецФункции");
	ОчередьЗагрузки.ДобавитьСтроку("//---------------------------------------");
	ОчередьЗагрузки.ДобавитьСтроку("Функция Функция2(ВерсияФормата) Экспорт");
	ОчередьЗагрузки.ДобавитьСтроку(Символы.Таб + "ОчередьЗагрузки = ОчередьЗагрузкиОбъектов();");
	ОчередьЗагрузки.ДобавитьСтроку(Символы.Таб + "ОчередьЗагрузкиПоВерсии = Новый Соответствие();");
	ОчередьЗагрузки.ДобавитьСтроку(Символы.Таб + "Для Каждого ЭлементОчереди Из ОчередьЗагрузки Цикл");
	ОчередьЗагрузки.ДобавитьСтроку(Символы.Таб + Символы.Таб + "Если СтрНайти(ЭлементОчереди.Ключ, ВерсияФормата) > 0 Тогда");
	ОчередьЗагрузки.ДобавитьСтроку(Символы.Таб + Символы.Таб + Символы.Таб + "ОчередьЗагрузкиПоВерсии.Вставить(ЭлементОчереди.Ключ, ЭлементОчереди.Значение);");
	ОчередьЗагрузки.ДобавитьСтроку(Символы.Таб + Символы.Таб + "КонецЕсли;");
	ОчередьЗагрузки.ДобавитьСтроку(Символы.Таб + "КонецЦикла");
	ОчередьЗагрузки.ДобавитьСтроку(Символы.Таб + "Возврат ОчередьЗагрузкиПоВерсии;");
	ОчередьЗагрузки.ДобавитьСтроку("КонецФункции");
	ОчередьЗагрузки.ДобавитьСтроку("//---------------------------------------");
	ОчередьЗагрузки.ДобавитьСтроку("Функция ОчередьЗагрузкиОбъектов()");
	ОчередьЗагрузки.ДобавитьСтроку(Символы.Таб + "ОчередьЗагрузки = Новый Соответствие();");
	Для Каждого СтрТаб Из ТабОчередьЗагрузки Цикл
		ТекОперанд = "ОчередьЗагрузки.Вставить(""%1"", Новый Структура(""Приоритет, ПутьКДате"", %2, ""%3""));";
		ТекОперанд = СтрЗаменить(ТекОперанд, "%1", Строка(ФабрикаXDTO.Тип(ИмяПространстваИмен,СтрТаб.ОбъектФормата)));
		ТекОперанд = СтрЗаменить(ТекОперанд, "%2", СтрТаб.Порядок);
		ТекОперанд = СтрЗаменить(ТекОперанд, "%3", СтрТаб.ПорядокПоСвойствам);
		ОчередьЗагрузки.ДобавитьСтроку(Символы.Таб + ТекОперанд);
	КонецЦикла;
	ОчередьЗагрузки.ДобавитьСтроку(Символы.Таб + "Возврат ОчередьЗагрузки;");
	ОчередьЗагрузки.ДобавитьСтроку("КонецФункции");
КонецПроцедуры


#КонецОбласти
